{
    "registration" : [
        ["Gender",
            "Male",
            "Female",
            "Other"
        ],
        ["School Year",
            "Year 5",
            "Year 6",
            "Year 7",
            "Year 8",
            "Year 9",
            "Year 10",
            "Year 11",
            "Year 12"
        ],
        ["Nationality",
            "none", "Afghanistan", "Albania", "Algeria", "American Samoa", "Andorra", "Angola", "Anguilla", "Antarctica",
            "Antigua and Barbuda", "Argentina", "Armenia", "Aruba", "Australia", "Austria", "Azerbaijan",
            "Bahamas", "Bahrain", "Bangladesh", "Barbados", "Belarus", "Belgium", "Belize", "Benin", "Bermuda", "Bhutan", "Bolivia",
            "Bosnia and Herzegowina","Botswana","Bouvet Island","Brazil","British Indian Ocean Territory", "Brunei Darussalam", "Bulgaria",
            "Burkina Faso", "Burundi", "Cambodia", "Cameroon", "Canada", "Cape Verde", "Cayman Islands", "Central African Republic",
            "Chad", "Chile", "China", "Christmas Island", "Cocos (Keeling) Islands", "Colombia", "Comoros", "Congo",
            "Congo, the Democratic Republic of the", "Cook Islands", "Costa Rica", "Cote d'Ivoire", "Croatia (Hrvatska)",
            "Cuba", "Cyprus", "Czech Republic", "Denmark", "Djibouti", "Dominica", "Dominican Republic", "East Timor",
            "Ecuador", "Egypt", "El Salvador", "Equatorial Guinea", "Eritrea", "Estonia", "Ethiopia", "Falkland Islands (Malvinas)",
            "Faroe Islands", "Fiji", "Finland", "France", "France, Metropolitan", "French Guiana", "French Polynesia",
            "French Southern Territories", "Gabon", "Gambia", "Georgia", "Germany", "Ghana", "Gibraltar", "Greece", "Greenland",
            "Grenada", "Guadeloupe", "Guam", "Guatemala", "Guinea", "Guinea-Bissau", "Guyana", "Haiti", "Heard and Mc Donald Islands",
            "Holy See (Vatican City State)", "Honduras", "Hong Kong", "Hungary", "Iceland", "India", "Indonesia",
            "Iran (Islamic Republic of)", "Iraq", "Ireland", "Israel", "Italy", "Jamaica", "Japan", "Jordan", "Kazakhstan",
            "Kenya", "Kiribati", "Korea, Democratic People's Republic of", "Korea, Republic of", "Kuwait", "Kyrgyzstan",
            "Lao People's Democratic Republic", "Latvia", "Lebanon", "Lesotho", "Liberia", "Libyan Arab Jamahiriya", "Liechtenstein",
            "Lithuania", "Luxembourg", "Macau", "Macedonia, The Former Yugoslav Republic of", "Madagascar", "Malawi", "Malaysia",
            "Maldives", "Mali", "Malta", "Marshall Islands", "Martinique", "Mauritania", "Mauritius", "Mayotte", "Mexico",
            "Micronesia, Federated States of", "Moldova, Republic of", "Monaco", "Mongolia", "Montserrat", "Morocco", "Mozambique",
            "Myanmar", "Namibia", "Nauru", "Nepal", "Netherlands", "Netherlands Antilles", "New Caledonia", "New Zealand",
            "Nicaragua", "Niger", "Nigeria", "Niue", "Norfolk Island", "Northern Mariana Islands", "Norway", "Oman", "Pakistan",
            "Palau", "Panama", "Papua New Guinea", "Paraguay", "Peru", "Philippines", "Pitcairn", "Poland", "Portugal",
            "Puerto Rico", "Qatar", "Reunion", "Romania", "Russian Federation", "Rwanda", "Saint Kitts and Nevis", "Saint LUCIA",
            "Saint Vincent and the Grenadines", "Samoa", "San Marino", "Sao Tome and Principe", "Saudi Arabia", "Senegal",
            "Seychelles", "Sierra Leone", "Singapore", "Slovakia (Slovak Republic)", "Slovenia", "Solomon Islands", "Somalia",
            "South Africa", "South Georgia and the South Sandwich Islands", "Spain", "Sri Lanka", "St. Helena",
            "St. Pierre and Miquelon", "Sudan", "Suriname", "Svalbard and Jan Mayen Islands", "Swaziland", "Sweden",
            "Switzerland", "Syrian Arab Republic", "Taiwan, Province of China", "Tajikistan", "Tanzania, United Republic of",
            "Thailand", "Togo", "Tokelau", "Tonga", "Trinidad and Tobago", "Tunisia", "Turkey", "Turkmenistan",
            "Turks and Caicos Islands", "Tuvalu", "Uganda", "Ukraine", "United Arab Emirates", "United Kingdom",
            "United States", "United States Minor Outlying Islands", "Uruguay", "Uzbekistan", "Vanuatu", "Venezuela",
            "Viet Nam", "Virgin Islands (British)", "Virgin Islands (U.S.)", "Wallis and Futuna Islands", "Western Sahara",
            "Yemen", "Yugoslavia", "Zambia", "Zimbabwe"
        ],

        ["Language spoken at home"],
        ["Any other languages studied (except yyy)"]
    ],
    "questionnaire" : [
        ["Please explain why you agree most with the above statements that you placed below the right most column (+5)", "most agree"],
        ["Please explain why you agree least with the above statements that you placed below the left most column (-5)", "least agree"],
        ["Did you encounter any problems completing the survey?"],
        ["Any general comments or feedback"]
    ],
    "statements": [
        "I can see myself working in yyy",
        "I can see myself living in yyy",
        "I can see myself travelling to yyy for leisure",
        "I can see myself getting a job more easily thanks to my knowledge of the yyy language",
        "I can see myself pursuing an international career",
        "I can see myself working in a job that requires me to speak yyy",
        "I can see myself taking more yyy classes in the future at school",
        "I can see myself studying yyy in University",
        "I can see myself studying in yyy",
        "I can see myself studying yyy for many years",
        "I can see myself teaching yyy",
        "I can see myself translating to/from yyy",
        "I can see myself speaking yyy in everyday life",
        "I can see myself speaking yyy fluently",
        "I can see myself speaking yyy better than many other Australians",
        "I can see myself working hard to improve my yyy",
        "I can see myself learning another foreign language more easily",
        "I can see myself enjoying yyy popular culture such as music, films, TV etc.",
        "I can see myself reading magazines, books or website in yyy",
        "I can see myself using Social Networks in yyy",
        "I can see myself proud to show that I speak yyy",
        "I can see myself with close friendships with yyy people",
        "I can see myself able to integrate well in the yyy community in Perth",
        "I can see myself speaking yyy with my yyy friends",
        "I can see myself enjoying recreational activities with yyy people",
        "I can see myself fostering understanding between Australia and yyy",
        "I can see myself satisfied with my knowledge of the yyy language and culture",
        "I can see myself organising events related to yyy culture",
        "I can see myself able to better understand people from any other culture",
        "I can see myself with a better developed social network of friends",
        "I can see myself taking the WACE exam in yyy",
        "I can see my parents proud of my yyy language skills",
        "I can see my teacher proud of my yyy language skill",
        "I can see my parents asking me to study yyy in the future",
        "I can see my teacher suggesting me to study yyy in the future",
        "I can see myself studying yyy and getting good marks",
        "I can see myself studying harder than other subjects",
        "I can see myself around me saying that my yyy is good",
        "I can see myself becoming a role model for other yyy students",
        "I can see myself with a big interest in all things yyy",
        "I can see myself studying yyy to be with my friends",
        "I can see myself continuing to enjoy yyy class",
        "I can see myself as a more knowledgeable person",
        "I can see myself confidently speaking yyy",
        "I can see myself continuing to study yyy because I like my teacher",
        "I can see myself studying yyy for the challenge",
        "I can see myself studying yyy because it’s cool"
    ],
    "instructions":[
        [
            "Thank you for agreeing to take part in our study. For optimal performance, please maximise your browser window.",
            "Read the following instructions carefully. The program will ask you to follow these steps which will be detailed below.",
            "Step 1) Fill out the questions that you will find in the next page.",
            "Step 2) You will be given a series of statements. You will be able to read the statements one by one. Read each statement carefully, then sort it into one of three given groups that you will see on the screen, on whether you agree, you don't agree or you are neutral about it. You can always change your mind later.",
            "Step 3) You will be shown the statements again, this time divided into the groups you sorted in step 2. Now, sort the statements out on the given graph from a +5 (most agree) to a -5 (least agree) scale.",
            "Please remember that you can only sort the statements on the sorting grid by dragging and dropping each statement.",
            "You must sort all statements.",
            "Any card places in the same column has the same value, and it <i>does not matter</i> if you place it at the top of the bottom of a column.",
            "If you place a card under a negative number, it does not mean that you don't agree with it. It means that you simply agree with it less than those on the column to its right and more than those on the column to its left.",
            "Thank you so much for your help."
        ],
        [
            "Fill out the following questions concerning your personal details.",
            "Please answer truthfully and honestly, all data collected is stored securely and safely anonomised and thus cannot be used to identify you."
        ],
        [
            "You will be given a series of statement cards",
            "Read these statement cards one by one",
            "Sort the statement cards into one of three given groups that you will see on the screen by clicking and dragging with your mouse, depending on whether you agree, you don't agree or you are neutral about it.",
            "Alternatively, you may click on the agree, disagree and neutral groups with your mouse to sort cards as an alternative to clicking and dragging"
        ],
        [
            "You will be shown the statement cards again, this time divided into the groups you sorted in step 2.",
            "Click on statements from the three groups, and drag them into empty spaces on the grid with your mouse. You should sort the statements out on the given graph from a +5 (most agree) to a -5 (least agree) scale. You may swap already placed statements in the grid by clicking and dragging. You must sort all statements.",
            "Statements in the same column have the same value, and it <i>does not matter</i> if you place it at the top of the bottom of a column. A statement placed in a negative column does not imply you don't agree with it. It means that you simply agree with it less than those on the column to its right and more than those on the column to its left.",
            "Alternatively, you may click on one of the statement groups (agree, disagree, neutral) and then click an empty space on the grid to place the top most statement into that empty space. The currently selected group is indicated by the checkmark."
        ],
        [
            "You will be asked a series of questions concerning your submitted preferences and about the survey in general."
        ],
        [   "By clicking OK you acknowledge that you have read all relevant permission forms and agree to their terms and conditions" ],
        [
            "Please keep a record of the following information.",
            "In particular, your user ID is required if you wish to exit the survey and resume completion later or delete your data from the survey's dataset."
        ]
    ]
}
